doc/org-mode/validators/confirm_password.org

#+TITLE: Confirm Password Validator Element
#+STYLE: <LINK href='../stylesheet.css' rel='stylesheet' type='text/css' />
#+AUTHOR: Rusty Klophaus (@rklophaus)
#+OPTIONS:   H:2 num:1 toc:1 \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+EMAIL: 
#+TEXT: [[file:../index.org][Getting Started]] | [[file:../api.org][API]] | [[file:../elements.org][Elements]] | [[file:../actions.org][Actions]] | Validators | [[file:../handlers.org][Handlers]]  | [[file:../about.org][About]]

* Confirm Password Validator - #confirm_password {}

  When asking a user to enter a password (or other value) twice, confirm that the values match.

** Usage

#+BEGIN_SRC erlang
   wf:wire(ButtonID, ConfirmPasswordID, #validate { validators=[
     #confirm_password { text="Passwords must match.", password=PasswordID }
   ]})
#+END_SRC

** Attributes

   + text - (/string/) :: The text to display if validation fails.

   + password - (/atom/) :: Specify the Nitrogen Element ID of the Password textbox.
