doc/html/validators/confirm_password.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Confirm Password Validator Element</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2010-06-14 18:34:59 EDT"/>
<meta name="author" content="Rusty Klophaus (@rklophaus)"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<LINK href='../stylesheet.css' rel='stylesheet' type='text/css' />
</head>
<body>
<div id="content">

<h1 class="title">Confirm Password Validator Element</h1>

<p><a href="../index.html">Getting Started</a> | <a href="../api.html">API</a> | <a href="../elements.html">Elements</a> | <a href="../actions.html">Actions</a> | Validators | <a href="../handlers.html">Handlers</a>  | <a href="../about.html">About</a>
</p>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Confirm Password Validator - #confirm<sub>password</sub> {} </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Confirm Password Validator - #confirm<sub>password</sub> {} </h2>
<div class="outline-text-2" id="text-1">


<p>
When asking a user to enter a password (or other value) twice, confirm that the values match.
</p>

</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1"><span class="section-number-3">1.1</span> Usage </h3>
<div class="outline-text-3" id="text-1.1">





<pre class="src src-erlang"><span style="color: #28439B;">wf</span>:<span style="color: #28439B;">wire</span>(<span style="color: #000000;">ButtonID</span>, <span style="color: #000000;">ConfirmPasswordID</span>, #<span style="color: #28439B;">validate</span> { validators=[
  #<span style="color: #28439B;">confirm_password</span> { text=<span style="color: #09A240;">"Passwords must match."</span>, password=<span style="color: #000000;">PasswordID</span> }
]})
</pre>




</div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2"><span class="section-number-3">1.2</span> Attributes </h3>
<div class="outline-text-3" id="text-1.2">


<dl>
<dt>text - (<i>string</i>)</dt><dd>
The text to display if validation fails.

</dd>
<dt>password - (<i>atom</i>)</dt><dd>
Specify the Nitrogen Element ID of the Password textbox.
</dd>
</dl>
</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Rusty Klophaus (@rklophaus)
<a href="mailto:">&lt;&gt;</a>
</p>
<p class="date"> Date: 2010-06-14 18:34:59 EDT</p>
<p class="creator">HTML generated by org-mode 6.33f in emacs 22</p>
</div>
</div>
</body>
</html>
